Tekla.Structures.Solid.LoopEnumerator
The LoopEnumerator class is used to enumerate the loops of a face instance.

Tekla.Structures.Solid.LoopEnumerator.#ctor(System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}})
Instantiates a new loop enumerator.
Enumerator: The father face's loop list enumerator.

Tekla.Structures.Solid.LoopEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Solid.LoopEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Solid.LoopEnumerator.Current
Returns the current loop.